%--------------------------------------------------------------------------



%   初始化



%--------------------------------------------------------------------------



clear;clc;







%--------------------------------------------------------------------------



%   参数设置



%--------------------------------------------------------------------------



N = 11000000;                                                               %人口总数（武汉）

E = 0;                                                                      %潜伏者

I = 1;                                                                      %发病者

S = N - I;                                                                  %从未感染人数

R = 0;                                                                      %康复者

D = 0;                                                                      %每日死亡人数

Dt = 0;                                                                     %总死亡人数

C = 0;                                                                      %携带者

Q = 0;                                                                      %每日确诊人数                                     

Qt = 0;                                                                     %总确诊人数                  


d = 0.009;                                                                 %死亡率

B = 2.05*10^-4;                                                             %发病者传染正常人概率

a = 1/7;                                                                    %潜伏者转化为感染者概率

B2 = 0.13;                                                                  %潜伏者传染正常人的概率

y = 0.007;                                                                 %康复概率

o = 0.8;                                                                   %外出概率 

cw = 5000;                                                                 %每日就医人数

T = 1:120                                                                  %时间（单位：天）

for idx = 1:length(T)-1

    r2 =10;                                                                %潜伏者接触易感者的人数

    r =10;                                                                 %发病者接触从未感染者的人数

    if idx>=30       

        r = 5;

        r2 = 5;

        o = 0.5;

        cw=15000;

        y = 0.055;

        d = 1.35*10^-4;
    end
    if idx>=40

        o=0;

        r=0;

        r2=0;

        cw=25000;
        
       y = 0.075;
    end
    S(idx+1) = S(idx) - r*o*B*S(idx)*(I(idx)-Q(idx)*I(idx)/N)/N(1) - r2*o*B2*S(idx)*(E(idx)-Q(idx)*E(idx)/N)/N;

    E(idx+1) = E(idx) + r*B*o*S(idx)*(I(idx)-Q(idx)*I(idx)/N)/N(1)-a*E(idx) + r2*o*B2*S(idx)*(E(idx)-Q(idx)*E(idx)/N)/N;

    I(idx+1) = I(idx) + a*E(idx) - y*I(idx) -d * I(idx);

    R(idx+1) = R(idx) + y*I(idx);

    D(idx+1) = d * I(idx);

    Dt(idx+1) = Dt(idx) + D(idx);

    C (idx+1) = I(idx) + E(idx);

    Q (idx+1) = C(idx)*cw/(N - Dt(idx));

end
plot(T,S,'p',T,E,'m',T,I,'r',T,R,'g',T,Dt,'--r',T,C,'k');grid on;

hold on

xlabel('天');ylabel('人数')

legend('从未感染者','潜伏者','发病者','康复者','总死亡人数','携带者')

title('戒严措施和医疗条件对新冠SEIR模型的影响')